# GetPreviousNonZeroLayerIndex Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetPreviousNonZeroLayerIndex Method
CompoundStructure Class See Also
---
Returns the index of the nearest non-zero width layer before this layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetPreviousNonZeroLayerIndex(
	int thisIdx
)
```

Visual Basic
---
```text
Public Function GetPreviousNonZeroLayerIndex ( _
	thisIdx As Integer _
) As Integer
```

Visual C++
---
```text
public:
int GetPreviousNonZeroLayerIndex(
	int thisIdx
)
```

# ### Parameters
thisIdx
    Type: System..::..Int32 The layer from which to look for a non-zero width layer.
# ### Return Value
The index of the layer found.
# Remarks
If this layer is non-zero width, it will be returned. If there are non-zero width layers found, returns -1.
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace